# Data Cleaning and Preparation

# Handling Missing Data

In [4]:
import numpy as np
import pandas as pd

In [6]:
float_data = pd.Series([1.2,3.5,np.nan,0])
float_data

0    1.2
1    3.5
2    NaN
3    0.0
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data = pd.Series(['aardvark',np.nan,None,'avocado'])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [9]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [10]:
float_data = pd.Series([1,2,None],dtype ='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [11]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## NA handling object methods

|Method	|Description|
|-|-|
|dropna	|Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.|
||根据每个标签的值是否包含缺失数据来过滤轴标签，并使用不同的阈值来容忍缺失数据的数量。|
|fillna	|Fill in missing data with some value or using an interpolation method such as "ffill" or "bfill".|
||使用某些值或使用插值方法（例如"ffill"或"bfill"填充缺失数据。|
|isna	|Return Boolean values indicating which values are missing/NA.|
||返回布尔值，指示哪些值缺失/NA。|
|notna	|Negation of isna, returns True for non-NA values and False for NA values.|
||isna的否定，对于非 NA 值返回True ，对于 NA 值返回False 。|

## Filtering Out Missing Data

In [17]:
# for Series
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
# same result with
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
# for DataFrame
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
# dropna by default drops any row containing a missing value:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [21]:
# how="all" will drop only rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [34]:
data.dropna(axis='columns',how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [36]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0 -0.180566       NaN       NaN
1 -0.409323       NaN       NaN
2  0.039462       NaN -0.018520
3  0.871068       NaN  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [37]:
df.dropna()

          0         1         2
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [38]:
df.dropna(thresh=2)

          0         1         2
2  0.039462       NaN -0.018520
3  0.871068       NaN  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

## Filling in Missing Data

In [39]:
df.fillna(0)

          0         1         2
0 -0.180566  0.000000  0.000000
1 -0.409323  0.000000  0.000000
2  0.039462  0.000000 -0.018520
3  0.871068  0.000000  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [40]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.180566  0.500000  0.000000
1 -0.409323  0.500000  0.000000
2  0.039462  0.500000 -0.018520
3  0.871068  0.500000  1.513187
4 -0.061802  1.677225 -2.106719
5  1.594734  1.166626  0.016112
6 -0.159056 -0.299680  1.808882

In [41]:
df = pd.DataFrame(np.random.standard_normal((6,3)))
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan
df

          0         1         2
0  1.155804 -0.081315 -1.187065
1 -0.111969 -0.085885  1.360198
2 -0.890839       NaN -0.829521
3  0.207553       NaN  1.401190
4 -3.448040       NaN       NaN
5 -0.962241       NaN       NaN

In [42]:
df.fillna(method='ffill')

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  1.155804 -0.081315 -1.187065
1 -0.111969 -0.085885  1.360198
2 -0.890839 -0.085885 -0.829521
3  0.207553 -0.085885  1.401190
4 -3.448040 -0.085885  1.401190
5 -0.962241 -0.085885  1.401190

In [43]:
df.fillna(method='ffill',limit=2)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/2005079682.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',limit=2)

          0         1         2
0  1.155804 -0.081315 -1.187065
1 -0.111969 -0.085885  1.360198
2 -0.890839 -0.085885 -0.829521
3  0.207553 -0.085885  1.401190
4 -3.448040       NaN  1.401190
5 -0.962241       NaN  1.401190

In [45]:
data = pd.Series([1, np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [46]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## fillna function arguments

|Argument	|Description|
|-|-|
|value	|Scalar value or dictionary-like object to use to fill missing values|
||用于填充缺失值的标量值或类似字典的对象|
|method	|Interpolation method: one of "bfill" (backward fill) or "ffill" (forward fill); default is None|
||插值方法： "bfill" （向后填充）或"ffill" （向前填充）之一；默认为None|
|axis	|Axis to fill on ("index" or "columns"); default is axis="index"|
||要填充的轴（ "index"或"columns" ）；默认axis="index"|
|limit	|For forward and backward filling, maximum number of consecutive periods to fill|
||对于向前和向后填充，要填充的最大连续周期数|

# Data Transformation

## Removing Duplicates

In [47]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [54]:
data = pd.DataFrame({'food':["bacon", "pulled pork", "bacon",
                             "pastrami", "corned beef", "bacon",
                             "pastrami", "honey ham", "nova lox"],
                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [55]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [56]:
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
def get_animal(x):
    return meat_to_animal[x]

data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [58]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [64]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [68]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [71]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [72]:
bins = [18, 25, 35, 60, 100]

In [73]:
age_categories = pd.cut(ages,bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [76]:
age_categories.categories[0]
#closed是指包含

Interval(18, 25, closed='right')

In [77]:
pd.value_counts(age_categories)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [79]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [81]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [82]:
data = np.random.uniform(size=20)
pd.cut(data,4,precision=2)

[(0.29, 0.52], (0.52, 0.76], (0.52, 0.76], (0.29, 0.52], (0.76, 0.99], ..., (0.52, 0.76], (0.52, 0.76], (0.052, 0.29], (0.052, 0.29], (0.52, 0.76]]
Length: 20
Categories (4, interval[float64, right]): [(0.052, 0.29] < (0.29, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

In [83]:
data = np.random.standard_normal(1000)
quartiles=pd.qcut(data,4,precision=2)
quartiles

[(-0.71, -0.048], (-3.21, -0.71], (-0.048, 0.67], (-0.048, 0.67], (-3.21, -0.71], ..., (-0.71, -0.048], (-0.048, 0.67], (0.67, 3.94], (-0.71, -0.048], (-3.21, -0.71]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.21, -0.71] < (-0.71, -0.048] < (-0.048, 0.67] < (0.67, 3.94]]

In [84]:
pd.value_counts(quartiles)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.21, -0.71]     250
(-0.71, -0.048]    250
(-0.048, 0.67]     250
(0.67, 3.94]       250
Name: count, dtype: int64

In [85]:
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

(-3.201, -1.39]     100
(-1.39, -0.0483]    400
(-0.0483, 1.196]    400
(1.196, 3.945]      100
Name: count, dtype: int64

## Detecting and Filtering Outliers

In [86]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036646     0.015634     0.021130    -0.013543
std       1.010609     1.006049     1.006185     0.977450
min      -3.231258    -3.474667    -3.413976    -2.931713
25%      -0.691123    -0.649302    -0.639660    -0.689755
50%      -0.073203     0.013819     0.015219    -0.019302
75%       0.651078     0.723879     0.696788     0.673813
max       2.599925     3.579569     3.926695     2.736021

In [87]:
col = data[2]
col[col.abs() > 3]

263    3.926695
577   -3.413976
601    3.236472
934    3.388749
Name: 2, dtype: float64

In [88]:
data[(data.abs() > 3).any(axis = 'columns')]

            0         1         2         3
37  -0.934610 -3.084245 -0.482283 -1.623173
95  -0.109214 -3.474667 -0.573350  2.365961
238 -3.231258 -0.557359 -1.070965 -0.789185
263  0.202718  0.205066  3.926695 -1.103474
323 -3.161323  1.142795 -0.519326  0.158720
355 -0.078049  3.129967 -0.984636  0.530860
573 -0.117331  3.446846 -1.151410 -1.552983
577  0.013802 -0.621791 -3.413976 -1.167381
601 -0.009041  1.270402  3.236472 -1.600399
739  1.552471  3.041479 -0.633470  0.300887
741 -0.379776  3.579569 -0.772373  0.173566
934  0.315967  1.886791  3.388749 -0.210298

In [90]:
data[data.abs() >3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.036253     0.014995     0.019992    -0.013543
std       1.009417     1.000408     0.999704     0.977450
min      -3.000000    -3.000000    -3.000000    -2.931713
25%      -0.691123    -0.649302    -0.639660    -0.689755
50%      -0.073203     0.013819     0.015219    -0.019302
75%       0.651078     0.723879     0.696788     0.673813
max       2.599925     3.000000     3.000000     2.736021

In [91]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0  1.0 -1.0

## Permutation and Random Sampling

In [92]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [93]:
sampler = np.random.permutation(5)
sampler

array([3, 2, 1, 4, 0])

In [94]:
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [96]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [97]:
column_sampler = np.random.permutation(7)
column_sampler

array([2, 1, 4, 3, 5, 6, 0])

In [98]:
df.take(column_sampler,axis='columns')

    2   1   4   3   5   6   0
0   2   1   4   3   5   6   0
1   9   8  11  10  12  13   7
2  16  15  18  17  19  20  14
3  23  22  25  24  26  27  21
4  30  29  32  31  33  34  28

In [100]:
df.sample(n=3)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [101]:
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

3    6
0    5
2   -1
1    7
2   -1
1    7
2   -1
3    6
4    4
1    7
dtype: int64

## Computing Indicator/Dummy Variables

In [102]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [104]:
pd.get_dummies(df['key'],dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [105]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [107]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table('/Users/qian/Desktop/DATA/WESMdatasets/movielens/movies.dat',sep='::',
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [112]:
dummies = movies['genres'].str.get_dummies('|')
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [115]:
movies_windic = movies.join(dummies.add_prefix('genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
genre_Action                                   0
genre_Adventure                                0
genre_Animation                                1
genre_Children's                               1
genre_Comedy                                   1
genre_Crime                                    0
genre_Documentary                              0
genre_Drama                                    0
genre_Fantasy                                  0
genre_Film-Noir                                0
genre_Horror                                   0
genre_Musical                                  0
genre_Mystery                                  0
genre_Romance                                  0
genre_Sci-Fi                                   0
genre_Thriller                                 0
genre_War                                      0
genre_Western                                  0
Name: 0, dtype: object

In [116]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [117]:
bins=[0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

# Extension Data Types

In [119]:
s = pd.Series([1,2,3,None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [120]:
s.dtype

dtype('float64')

In [121]:
s = pd.Series([1,2,3,None],dtype = pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [122]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [123]:
s.dtype

Int64Dtype()

In [124]:
s[3]

In [125]:
s[3] is pd.NA

True

In [126]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [127]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [128]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [129]:
df['A'] = df['A'].astype('Int64')
df['B'] = df['B'].astype('string')
df['C'] = df['C'].astype('boolean')
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## pandas extension data types

|Extension type	|Description|
|-|-|
|BooleanDtype	|Nullable Boolean data, use "boolean" when passing as string|
|CategoricalDtype	|Categorical data type, use "category" when passing as string|
|DatetimeTZDtype	|Datetime with time zone |
|Float32Dtype	|32-bit nullable floating point, use "Float32" when passing as string|
|Float64Dtype	|64-bit nullable floating point, use "Float64" when passing as string|
|Int8Dtype	|8-bit nullable signed integer, use "Int8" when passing as string|
|Int16Dtype	|16-bit nullable signed integer, use "Int16" when passing as string|
|Int32Dtype	|32-bit nullable signed integer, use "Int32" when passing as string|
|Int64Dtype	|64-bit nullable signed integer, use "Int64" when passing as string|
|UInt8Dtype	|8-bit nullable unsigned integer, use "UInt8" when passing as string|
|UInt16Dtype	|16-bit nullable unsigned integer, use "UInt16" when passing as string|
|UInt32Dtype	|32-bit nullable unsigned integer, use "UInt32" when passing as string|
|UInt64Dtype	|64-bit nullable unsigned integer, use "UInt64" when passing as string|

# String Manipulation

## Python Built-In String Object Methods

In [131]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [132]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [133]:
first, second, third = pieces
first + '::'+ second + '::' + third

'a::b::guido'

In [134]:
'::'.join(pieces)

'a::b::guido'

In [135]:
'guido' in val

True

In [137]:
val.index(',')

1

In [139]:
#the difference between find and index is that index raises an exception if the string isn’t found (versus returning –1)
val.find(':')

-1

In [140]:
val.index(':')

ValueError: substring not found

In [141]:
val.count(',')

2

In [142]:
val.replace(',', '::')

'a::b::  guido'

In [143]:
val.replace(',','')

'ab  guido'

## Python built-in string methods

|Method 	|Description |
|-|-|
|count	|Return the number of nonoverlapping occurrences of substring in the string|
||返回字符串中子字符串不重叠出现的次数|
|endswith	|Return True if string ends with suffix|
||如果字符串以后缀结尾则返回True|
|startswith	|Return True if string starts with prefix|
||如果字符串以前缀开头则返回True|
|join	|Use string as delimiter for concatenating a sequence of other strings|
||使用字符串作为分隔符来连接一系列其他字符串|
|index	|Return starting index of the first occurrence of passed substring if found in the string; otherwise, raises ValueError if not found|
||如果在字符串中找到，则返回传递的子字符串第一次出现的起始索引；否则，如果未找到，则引发ValueError|
|find	|Return position of first character of first occurrence of substring in the string; like index, but returns –1 if not found|
||返回子字符串在字符串中第一次出现的第一个字符的位置；与index类似，但如果未找到则返回 –1|
|rfind	|Return position of first character of last occurrence of substring in the string; returns –1 if not found|
||返回字符串中最后一次出现的子字符串的第一个字符的位置；如果未找到则返回 –1|
|replace	|Replace occurrences of string with another string|
||将出现的字符串替换为另一个字符串|
|strip, rstrip, lstrip	|Trim whitespace, including newlines on both sides, on the right side, or on the left side, respectively|
||修剪空白，包括两侧、右侧或左侧的换行符|
|split	|Break string into list of substrings using passed delimiter|
||使用传递的分隔符将字符串分解为子字符串列表|
|lower	|Convert alphabet characters to lowercase|
|upper	|Convert alphabet characters to uppercase|
|casefold	|Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form|
||将字符转换为小写，并将任何特定于区域的可变字符组合转换为通用的可比较形式|
|ljust, rjust	|Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width|
||分别左对齐或右对齐；用空格（或其他填充字符）填充字符串的另一侧，以返回具有最小宽度的字符串|

## Regular Expressions

In [145]:
import re

In [146]:
text = "foo    bar\t baz  \tqux"
re.split(r'\s+', text)

['foo', 'bar', 'baz', 'qux']

In [147]:
regex = re.compile(r'\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [148]:
regex.findall(text)

['    ', '\t ', '  \t']

In [149]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [150]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [156]:
# search returns a special match object for the first email address in the text
m=regex.search(text)
m

In [157]:
text[m.start():m.end()]

'dave@google.com'

In [158]:
#regex.match returns None, it will match only if the pattern occurs at the start of the string:
print(regex.match(text))

None

In [159]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [160]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [161]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [163]:
# findall returns a list of tuples when the pattern has groups
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [164]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Regular expression methods

|Method	|Description|
|-|-|
|findall	|Return all nonoverlapping matching patterns in a string as a list|
||以列表形式返回字符串中所有不重叠的匹配模式|
|finditer	|Like findall, but returns an iterator|
||与findall类似，但返回一个迭代器|
|match	|Match pattern at start of string and optionally segment pattern components into groups; if the pattern matches, return a match object, and otherwise None|
||在字符串开头匹配模式，并可选择将模式组件分段；如果模式匹配，则返回匹配对象，否则None|
|search	|Scan string for match to pattern, returning a match object if so; unlike match, the match can be anywhere in the string as opposed to only at the beginning|
||扫描字符串是否与模式匹配，如果匹配则返回匹配对象；与match不同，匹配可以位于字符串中的任何位置，而不是仅在开头|
|split	|Break string into pieces at each occurrence of pattern|
||在每次出现模式时将字符串分成几部分|
|sub, subn	|Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression; use symbols \1, \2, ... to refer to match group elements in the replacement string|
||用替换表达式替换字符串中所有 ( sub ) 或前n出现 ( subn ) 的模式；使用符号\1, \2, ...来引用替换字符串中的匹配组元素|

## String Functions in pandas

In [165]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [167]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [168]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [169]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [170]:
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [171]:
data_as_string_ext.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [172]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [174]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [175]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [176]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [179]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [177]:
data.str.extract(pattern, flags = re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

## Partial listing of Series string methods

|Method	|Description|
|-|-|
|cat	|Concatenate strings element-wise with optional delimiter|
||使用可选分隔符按元素连接字符串|
|contains	|Return Boolean array if each string contains pattern/regex|
||如果每个字符串包含模式/正则表达式，则返回布尔数组|
|count	|Count occurrences of pattern|
|extract	|Use a regular expression with groups to extract one or more strings from a Series of strings; the result will be a DataFrame with one column per group|
||使用带有组的正则表达式从一系列字符串中提取一个或多个字符串；结果将是一个 DataFrame，每组一列|
|endswith	|Equivalent to x.endswith(pattern) for each element|
|startswith	|Equivalent to x.startswith(pattern) for each element|
|findall	|Compute list of all occurrences of pattern/regex for each string|
||计算每个字符串的所有模式/正则表达式出现的列表|
|get	|Index into each element (retrieve i-th element)|
||对每个元素进行索引（检索第 i个元素）|
|isalnum	|Equivalent to built-in str.alnum|
|isalpha	|Equivalent to built-in str.isalpha|
|isdecimal	|Equivalent to built-in str.isdecimal|
|isdigit	|Equivalent to built-in str.isdigit|
|islower	|Equivalent to built-in str.islower|
|isnumeric	|Equivalent to built-in str.isnumeric|
|isupper	|Equivalent to built-in str.isupper|
|join	|Join strings in each element of the Series with passed separator|
||使用传递的分隔符连接系列的每个元素中的字符串|
|len	|Compute length of each string|
|lower, upper	|Convert cases; equivalent to x.lower() or x.upper() for each element|
||转换大小写；相当于每个元素的x.lower()或x.upper()|
|match	|Use re.match with the passed regular expression on each element, returning True or False whether it matches|
||对每个元素使用re.match与传递的正则表达式，无论是否匹配都返回True或False|
|pad	|Add whitespace to left, right, or both sides of strings|
||在字符串的左侧、右侧或两侧添加空格|
|center	|Equivalent to pad(side="both")|
||相当于pad(side="both")|
|repeat	|Duplicate values (e.g., s.str.repeat(3) is equivalent to x * 3 for each string)|
||重复值（例如， s.str.repeat(3)相当于每个字符串的x * 3 ）|
|replace	|Replace occurrences of pattern/regex with some other string|
||将出现的模式/正则表达式替换为其他字符串|
|slice	|Slice each string in the Series|
||对系列中的每个字符串进行切片|
|split	|Split strings on delimiter or regular expression|
||根据分隔符或正则表达式分割字符串|
|strip	|Trim whitespace from both sides, including newlines|
|rstrip	|Trim whitespace on right side|
|lstrip	|Trim whitespace on left side|

# Categorical Data

## Background and Motivation

In [180]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [181]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [182]:
pd.value_counts(values)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [185]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple','orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [186]:
dim

0     apple
1    orange
dtype: object

In [187]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

## Categorical Extension Type in pandas

In [188]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N= len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                   columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [189]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [190]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [191]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [193]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [194]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [195]:
df['fruit'] = df['fruit'].astype('category')
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [197]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [198]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [199]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [200]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

## Computations with Categoricals

In [201]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [203]:
bins = pd.qcut(draws,4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [205]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [207]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [210]:
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count', 'min', 'max'])
           .reset_index())
results

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_75996/2483392743.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [212]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

### better performance with categoricals

In [213]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [214]:
categories = labels.astype('category')

In [215]:
labels.memory_usage(deep=True)

520000132

In [216]:
categories.memory_usage(deep=True)

10000512

In [217]:
%time _ = labels.astype('category')

CPU times: user 252 ms, sys: 93.2 ms, total: 345 ms
Wall time: 437 ms

In [218]:
%timeit labels.value_counts()

402 ms ± 142 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [219]:
%timeit categories.value_counts()

42.1 ms ± 6.1 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

## Categorical Methods

In [221]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: object

In [222]:
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [225]:
# special accessor attribute cat provides access to categorical methods
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [226]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [227]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

In [228]:
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [229]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [230]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [231]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [232]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

### Creating dummy variables for modeling

In [233]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [234]:
pd.get_dummies(cat_s, dtype=float)

     a    b    c    d
0  1.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0

## Categorical methods for Series in pandas

|Method	|Description|
|-|-|
|add_categories	|Append new (unused) categories at end of existing categories|
||在现有类别末尾附加新的（未使用的）类别|
|as_ordered	|Make categories ordered| 
|as_unordered	|Make categories unordered|
|remove_categories	|Remove categories, setting any removed values to null|
||删除类别，将所有删除的值设置为 null|
|remove_unused_categories	|Remove any category values that do not appear in the data|
|rename_categories	|Replace categories with indicated set of new category names; cannot change the number of categories|
||用指示的一组新类别名称替换类别；无法更改类别数量|
|reorder_categories	|Behaves like rename_categories, but can also change the result to have ordered categories|
||行为类似于rename_categories ，但也可以将结果更改为有序类别|
|set_categories	|Replace the categories with the indicated set of new categories; can add or remove categories|
||将类别替换为指定的一组新类别；可以添加或删除类别|